MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFE124/mcu.h
extern volatile __ABF1DEVCFG3bits_t ABF1DEVCFG3bits __asm__ ("ABF1DEVCFG3") __attribute__((section("sfrs"), address(0xBFC4FF40)));
#define ABF1DEVCFG2 ABF1DEVCFG2
extern volatile uint32_t   ABF1DEVCFG2 __attribute__((section("sfrs"), address(0xBFC4FF44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :11;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG2bits_t;
extern volatile __ABF1DEVCFG2bits_t ABF1DEVCFG2bits __asm__ ("ABF1DEVCFG2") __attribute__((section("sfrs"), address(0xBFC4FF44)));
#define ABF1DEVCFG1 ABF1DEVCFG1
extern volatile uint32_t   ABF1DEVCFG1 __attribute__((section("sfrs"), address(0xBFC4FF48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG1bits_t;
extern volatile __ABF1DEVCFG1bits_t ABF1DEVCFG1bits __asm__ ("ABF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC4FF48)));
#define ABF1DEVCFG0 ABF1DEVCFG0
extern volatile uint32_t   ABF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC4FF4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t :8;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG0bits_t;
extern volatile __ABF1DEVCFG0bits_t ABF1DEVCFG0bits __asm__ ("ABF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC4FF4C)));
#define ABF1DEVCP3 ABF1DEVCP3
extern volatile uint32_t   ABF1DEVCP3 __attribute__((section("sfrs"), address(0xBFC4FF50)));
#define ABF1DEVCP2 ABF1DEVCP2
extern volatile uint32_t   ABF1DEVCP2 __attribute__((section("sfrs"), address(0xBFC4FF54)));
#define ABF1DEVCP1 ABF1DEVCP1
extern volatile uint32_t   ABF1DEVCP1 __attribute__((section("sfrs"), address(0xBFC4FF58)));
#define ABF1DEVCP0 ABF1DEVCP0
extern volatile uint32_t   ABF1DEVCP0 __attribute__((section("sfrs"), address(0xBFC4FF5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCP0bits_t;
extern volatile __ABF1DEVCP0bits_t ABF1DEVCP0bits __asm__ ("ABF1DEVCP0") __attribute__((section("sfrs"), address(0xBFC4FF5C)));
#define ABF1DEVSIGN3 ABF1DEVSIGN3
extern volatile uint32_t   ABF1DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC4FF60)));
#define ABF1DEVSIGN2 ABF1DEVSIGN2
extern volatile uint32_t   ABF1DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC4FF64)));
#define ABF1DEVSIGN1 ABF1DEVSIGN1
extern volatile uint32_t   ABF1DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC4FF68)));
#define ABF1DEVSIGN0 ABF1DEVSIGN0
extern volatile uint32_t   ABF1DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC4FF6C)));
#define ABF1SEQ3 ABF1SEQ3
extern volatile uint32_t   ABF1SEQ3 __attribute__((section("sfrs"), address(0xBFC4FF70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1SEQ3bits_t;
extern volatile __ABF1SEQ3bits_t ABF1SEQ3bits __asm__ ("ABF1SEQ3") __attribute__((section("sfrs"), address(0xBFC4FF70)));
#define ABF1SEQ2 ABF1SEQ2
extern volatile uint32_t   ABF1SEQ2 __attribute__((section("sfrs"), address(0xBFC4FF74)));
#define ABF1SEQ1 ABF1SEQ1
extern volatile uint32_t   ABF1SEQ1 __attribute__((section("sfrs"), address(0xBFC4FF78)));
#define ABF1SEQ0 ABF1SEQ0
extern volatile uint32_t   ABF1SEQ0 __attribute__((section("sfrs"), address(0xBFC4FF7C)));
#define BF1DEVCFG3 BF1DEVCFG3
extern volatile uint32_t   BF1DEVCFG3 __attribute__((section("sfrs"), address(0xBFC4FFC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG3bits_t;
extern volatile __BF1DEVCFG3bits_t BF1DEVCFG3bits __asm__ ("BF1DEVCFG3") __attribute__((section("sfrs"), address(0xBFC4FFC0)));
#define BF1DEVCFG2 BF1DEVCFG2
extern volatile uint32_t   BF1DEVCFG2 __attribute__((section("sfrs"), address(0xBFC4FFC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :11;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG2bits_t;
extern volatile __BF1DEVCFG2bits_t BF1DEVCFG2bits __asm__ ("BF1DEVCFG2") __attribute__((section("sfrs"), address(0xBFC4FFC4)));
#define BF1DEVCFG1 BF1DEVCFG1
extern volatile uint32_t   BF1DEVCFG1 __attribute__((section("sfrs"), address(0xBFC4FFC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG1bits_t;
extern volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits __asm__ ("BF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC4FFC8)));
#define BF1DEVCFG0 BF1DEVCFG0
extern volatile uint32_t   BF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC4FFCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t :8;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG0bits_t;
extern volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits __asm__ ("BF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC4FFCC)));
#define BF1DEVCP3 BF1DEVCP3
extern volatile uint32_t   BF1DEVCP3 __attribute__((section("sfrs"), address(0xBFC4FFD0)));
#define BF1DEVCP2 BF1DEVCP2
extern volatile uint32_t   BF1DEVCP2 __attribute__((section("sfrs"), address(0xBFC4FFD4)));
#define BF1DEVCP1 BF1DEVCP1
extern volatile uint32_t   BF1DEVCP1 __attribute__((section("sfrs"), address(0xBFC4FFD8)));
#define BF1DEVCP0 BF1DEVCP0
extern volatile uint32_t   BF1DEVCP0 __attribute__((section("sfrs"), address(0xBFC4FFDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCP0bits_t;
extern volatile __BF1DEVCP0bits_t BF1DEVCP0bits __asm__ ("BF1DEVCP0") __attribute__((section("sfrs"), address(0xBFC4FFDC)));
#define BF1DEVSIGN3 BF1DEVSIGN3
extern volatile uint32_t   BF1DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC4FFE0)));
#define BF1DEVSIGN2 BF1DEVSIGN2
extern volatile uint32_t   BF1DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC4FFE4)));
#define BF1DEVSIGN1 BF1DEVSIGN1
extern volatile uint32_t   BF1DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC4FFE8)));
#define BF1DEVSIGN0 BF1DEVSIGN0
extern volatile uint32_t   BF1DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC4FFEC)));
#define BF1SEQ3 BF1SEQ3
extern volatile uint32_t   BF1SEQ3 __attribute__((section("sfrs"), address(0xBFC4FFF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __BF1SEQ3bits_t;
extern volatile __BF1SEQ3bits_t BF1SEQ3bits __asm__ ("BF1SEQ3") __attribute__((section("sfrs"), address(0xBFC4FFF0)));
#define BF1SEQ2 BF1SEQ2
extern volatile uint32_t   BF1SEQ2 __attribute__((section("sfrs"), address(0xBFC4FFF4)));
#define BF1SEQ1 BF1SEQ1
extern volatile uint32_t   BF1SEQ1 __attribute__((section("sfrs"), address(0xBFC4FFF8)));
#define BF1SEQ0 BF1SEQ0
extern volatile uint32_t   BF1SEQ0 __attribute__((section("sfrs"), address(0xBFC4FFFC)));
#define ABF2DEVCFG3 ABF2DEVCFG3
extern volatile uint32_t   ABF2DEVCFG3 __attribute__((section("sfrs"), address(0xBFC6FF40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG3bits_t;
extern volatile __ABF2DEVCFG3bits_t ABF2DEVCFG3bits __asm__ ("ABF2DEVCFG3") __attribute__((section("sfrs"), address(0xBFC6FF40)));
#define ABF2DEVCFG2 ABF2DEVCFG2
extern volatile uint32_t   ABF2DEVCFG2 __attribute__((section("sfrs"), address(0xBFC6FF44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :11;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG2bits_t;
