MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFE124/mcu.h
#define _OFF176_VOFF_POSITION                    0x00000001
#define _OFF176_VOFF_MASK                        0x0003FFFE
#define _OFF176_VOFF_LENGTH                      0x00000011

#define _OFF177_VOFF_POSITION                    0x00000001
#define _OFF177_VOFF_MASK                        0x0003FFFE
#define _OFF177_VOFF_LENGTH                      0x00000011

#define _OFF178_VOFF_POSITION                    0x00000001
#define _OFF178_VOFF_MASK                        0x0003FFFE
#define _OFF178_VOFF_LENGTH                      0x00000011

#define _OFF179_VOFF_POSITION                    0x00000001
#define _OFF179_VOFF_MASK                        0x0003FFFE
#define _OFF179_VOFF_LENGTH                      0x00000011

#define _OFF180_VOFF_POSITION                    0x00000001
#define _OFF180_VOFF_MASK                        0x0003FFFE
#define _OFF180_VOFF_LENGTH                      0x00000011

#define _OFF181_VOFF_POSITION                    0x00000001
#define _OFF181_VOFF_MASK                        0x0003FFFE
#define _OFF181_VOFF_LENGTH                      0x00000011

#define _OFF182_VOFF_POSITION                    0x00000001
#define _OFF182_VOFF_MASK                        0x0003FFFE
#define _OFF182_VOFF_LENGTH                      0x00000011

#define _OFF183_VOFF_POSITION                    0x00000001
#define _OFF183_VOFF_MASK                        0x0003FFFE
#define _OFF183_VOFF_LENGTH                      0x00000011

#define _OFF184_VOFF_POSITION                    0x00000001
#define _OFF184_VOFF_MASK                        0x0003FFFE
#define _OFF184_VOFF_LENGTH                      0x00000011

#define _OFF185_VOFF_POSITION                    0x00000001
#define _OFF185_VOFF_MASK                        0x0003FFFE
#define _OFF185_VOFF_LENGTH                      0x00000011

#define _OFF186_VOFF_POSITION                    0x00000001
#define _OFF186_VOFF_MASK                        0x0003FFFE
#define _OFF186_VOFF_LENGTH                      0x00000011

#define _OFF187_VOFF_POSITION                    0x00000001
#define _OFF187_VOFF_MASK                        0x0003FFFE
#define _OFF187_VOFF_LENGTH                      0x00000011

#define _OFF188_VOFF_POSITION                    0x00000001
#define _OFF188_VOFF_MASK                        0x0003FFFE
#define _OFF188_VOFF_LENGTH                      0x00000011

#define _OFF189_VOFF_POSITION                    0x00000001
#define _OFF189_VOFF_MASK                        0x0003FFFE
#define _OFF189_VOFF_LENGTH                      0x00000011

#define _OFF190_VOFF_POSITION                    0x00000001
#define _OFF190_VOFF_MASK                        0x0003FFFE
#define _OFF190_VOFF_LENGTH                      0x00000011

#define _OFF192_VOFF_POSITION                    0x00000001
#define _OFF192_VOFF_MASK                        0x0003FFFE
#define _OFF192_VOFF_LENGTH                      0x00000011

#define _OFF193_VOFF_POSITION                    0x00000001
#define _OFF193_VOFF_MASK                        0x0003FFFE
#define _OFF193_VOFF_LENGTH                      0x00000011

#define _OFF194_VOFF_POSITION                    0x00000001
#define _OFF194_VOFF_MASK                        0x0003FFFE
#define _OFF194_VOFF_LENGTH                      0x00000011

#define _OFF196_VOFF_POSITION                    0x00000001
#define _OFF196_VOFF_MASK                        0x0003FFFE
#define _OFF196_VOFF_LENGTH                      0x00000011

#define _OFF198_VOFF_POSITION                    0x00000001
#define _OFF198_VOFF_MASK                        0x0003FFFE
#define _OFF198_VOFF_LENGTH                      0x00000011

#define _OFF199_VOFF_POSITION                    0x00000001
#define _OFF199_VOFF_MASK                        0x0003FFFE
#define _OFF199_VOFF_LENGTH                      0x00000011

#define _OFF200_VOFF_POSITION                    0x00000001
#define _OFF200_VOFF_MASK                        0x0003FFFE
#define _OFF200_VOFF_LENGTH                      0x00000011

#define _OFF201_VOFF_POSITION                    0x00000001
#define _OFF201_VOFF_MASK                        0x0003FFFE
#define _OFF201_VOFF_LENGTH                      0x00000011

#define _OFF202_VOFF_POSITION                    0x00000001
#define _OFF202_VOFF_MASK                        0x0003FFFE
#define _OFF202_VOFF_LENGTH                      0x00000011

#define _OFF205_VOFF_POSITION                    0x00000001
#define _OFF205_VOFF_MASK                        0x0003FFFE
#define _OFF205_VOFF_LENGTH                      0x00000011

#define _OFF206_VOFF_POSITION                    0x00000001
#define _OFF206_VOFF_MASK                        0x0003FFFE
#define _OFF206_VOFF_LENGTH                      0x00000011

#define _OFF207_VOFF_POSITION                    0x00000001
#define _OFF207_VOFF_MASK                        0x0003FFFE
#define _OFF207_VOFF_LENGTH                      0x00000011

#define _OFF208_VOFF_POSITION                    0x00000001
#define _OFF208_VOFF_MASK                        0x0003FFFE
#define _OFF208_VOFF_LENGTH                      0x00000011

#define _OFF209_VOFF_POSITION                    0x00000001
#define _OFF209_VOFF_MASK                        0x0003FFFE
#define _OFF209_VOFF_LENGTH                      0x00000011

#define _OFF210_VOFF_POSITION                    0x00000001
#define _OFF210_VOFF_MASK                        0x0003FFFE
#define _OFF210_VOFF_LENGTH                      0x00000011

#define _OFF213_VOFF_POSITION                    0x00000001
#define _OFF213_VOFF_MASK                        0x0003FFFE
#define _OFF213_VOFF_LENGTH                      0x00000011

#define _DMACON_DMABUSY_POSITION                 0x0000000B
#define _DMACON_DMABUSY_MASK                     0x00000800
#define _DMACON_DMABUSY_LENGTH                   0x00000001

#define _DMACON_SUSPEND_POSITION                 0x0000000C
#define _DMACON_SUSPEND_MASK                     0x00001000
#define _DMACON_SUSPEND_LENGTH                   0x00000001

#define _DMACON_ON_POSITION                      0x0000000F
#define _DMACON_ON_MASK                          0x00008000
#define _DMACON_ON_LENGTH                        0x00000001

#define _DMASTAT_DMACH_POSITION                  0x00000000
#define _DMASTAT_DMACH_MASK                      0x00000007
#define _DMASTAT_DMACH_LENGTH                    0x00000003

#define _DMASTAT_RDWR_POSITION                   0x0000001F
#define _DMASTAT_RDWR_MASK                       0x80000000
#define _DMASTAT_RDWR_LENGTH                     0x00000001

